BUHTOOLS/src/DataProcessors/ДанныеПосредников/ДанныеПосредников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДанныеПосредников</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПосредников</name>
    <attributes>
      <name>КодПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПровайдера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Провайдер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Посредник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВознаграждениеUFS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлиентскаяОплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

BUHTOOLS/src/Documents/ДанныеПоПосредникам/ДанныеПоПосредникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеПоПосредникам</name>
  <registerRecords>AccumulationRegister.ДанныеПосредников</registerRecords>
  <attributes>
    <name>МесяцДанных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПосредников</name>
    <attributes>
      <name>КодПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Посредник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВознаграждениеUFS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПровайдера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Провайдер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлиентскаяОплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BUHTOOLS/src/DataProcessors/ДанныеПосредников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПолучитьДанныеПровайдеровЗаПериод(АдресВоВременномХранилище) Экспорт
  
    СтруктураДанных = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);

	ДатаНачала = СтруктураДанных.ДатаНачала;
	ДатаОкончания =  СтруктураДанных.ДатаОкончания;	
	
	Соединение = ОбщегоНазначенияSQL.СозданиеПодключениеUFS();
	ТЗ = ПолучитьПустуюТаблицуПосредников();
	
	СФормироватьДанныеПоПосредникам(ДатаНачала, ДатаОкончания, ТЗ, Соединение);
	
	Соединение.Close();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Данные",ТЗ );
	
	ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресВоВременномХранилище);

КонецПроцедуры

//
//Функция ЗапросПолученияДанныхПровайдера() Экспорт
//	
//	ЗапросТекст = " Select serv.class as SERV,
//				  |sum(acc.sumfee) as UFSFEE ,
//				  |sum(acc.sumsrv) as SRV,
//				  |acc.idtaker as ID,
//				  |mem.nameMember as Name
//				  |from ufs_Accountings acc (NOLOCK)
//				  |   join Trans t (NOLOCK) on acc.idtrans = t.idtrans and t.status = 0  and t.test = 0
//				  |    join OrderPayment op (NOLOCK) on t.OrderPaymentId = op.OrderPaymentId and op.Status = 0
//				  |     join Services serv (NOLOCK) on t.idServ = serv.idServ
//				  |      join members mem on mem.idMember = acc.idtaker
//				  | where acc.phase = 1  and acc.tpstatus = 5 and  acc.datereg >= @BEGDate and acc.datereg < @ENDDate and acc.idpayer = 47072 and acc.directfee = 1
//				  | group by serv.class,acc.idtaker,mem.nameMember";
//
//	Возврат ЗапросТекст;
//
//КонецФункции

Функция ПолучитьПустуюТаблицуПосредников() Экспорт
	
	ТаблицаПосредников = Новый ТаблицаЗначений();
	ТаблицаПосредников.Колонки.Добавить("КодПосредника",ОбщегоНазначения.ОписаниеТипаЧисло(5,0));
	ТаблицаПосредников.Колонки.Добавить("КодПровайдера",ОбщегоНазначения.ОписаниеТипаЧисло(5,0));
	ТаблицаПосредников.Колонки.Добавить("Посредник",ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПосредников.Колонки.Добавить("Провайдер",ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПосредников.Колонки.Добавить("Сервис",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаПосредников.Колонки.Добавить("Оборот",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПосредников.Колонки.Добавить("ВознаграждениеUFS",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаПосредников.Колонки.Добавить("КлиентскаяОплата",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Возврат ТаблицаПосредников;

КонецФункции

Процедура СФормироватьДанныеПоПосредникам(Знач ДатаНачала,Знач ДатаОкончания,Тз,Соединение) Экспорт
	
	ЗапросSQL = Посредники.ЗапросОтчетПоСайту();
		
	ОбщегоНазначенияSQL.СформироватьЗапросДляSQL(ДатаНачала,ДатаОкончания,ЗапросSQL);
	
	RecordSet = Соединение.Execute(ЗапросSQL);
	
	Пока НЕ RecordSet.EOF() Цикл
		
		НоваяСтрока = Тз.Добавить();
		

		НоваяСтрока.КодПровайдера = RecordSet.Fields("ProvID").Value;
		НоваяСтрока.Провайдер = RecordSet.Fields("ProvName").Value;
		
		НоваяСтрока.КодПосредника = RecordSet.Fields("BankID").Value;
		НоваяСтрока.Посредник = RecordSet.Fields("BankName").Value;
		
		НоваяСтрока.Сервис = RecordSet.Fields("SERV").Value;
		НоваяСтрока.Оборот = RecordSet.Fields("AMOUNT").Value;
		НоваяСтрока.ВознаграждениеUFS = RecordSet.Fields("FEE").Value;
		НоваяСтрока.КлиентскаяОплата = RecordSet.Fields("CLIENTPAY").Value;
		
		RecordSet.MoveNext();
		
	КонецЦикла;
	
	RecordSet.Close();	
	
	
КонецПроцедуры

Процедура ЗаписатьДанныеПосредников(АдресВХранилище) Экспорт

	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресВХранилище);

	ДокументПосредников = Документы.ДанныеПоПосредникам.СоздатьДокумент();
	ДокументПосредников.Дата = ТекущаяДатаСеанса();
	ДокументПосредников.Заполнить(СтруктураДанных);
	
	ДокументПосредников.Записать(РежимЗаписиДокумента.Проведение);
	
	УдалитьИзВременногоХранилища(АдресВХранилище);
	
КонецПроцедуры

#КонецЕсли
